In [4]:
from pandas import Series
from pandas import DataFrame
import numpy as np

In [2]:
s = Series([1,2,3,4],index=['d','c','b','a'])
s

d    1
c    2
b    3
a    4
dtype: int64

In [3]:
s.sort_index()

a    4
b    3
c    2
d    1
dtype: int64

In [5]:
d = DataFrame(np.arange(16).reshape(4,4),index=[1,2,3,4],columns=['d','c','b','a'])
d

    d   c   b   a
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [6]:
d.sort_index(axis=1)

    a   b   c   d
1   3   2   1   0
2   7   6   5   4
3  11  10   9   8
4  15  14  13  12

In [7]:
d.sort_index(axis=1,ascending=False)

    d   c   b   a
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [8]:
d.sort_index(ascending=False)

    d   c   b   a
4  12  13  14  15
3   8   9  10  11
2   4   5   6   7
1   0   1   2   3

In [9]:
prices = Series([300,200,900,500])
prices

0    300
1    200
2    900
3    500
dtype: int64

In [10]:
prices.sort_values()

1    200
0    300
3    500
2    900
dtype: int64

In [11]:
products = DataFrame({'name':['phone','laptop','tablet'],'price':[200,300,100]})
products

     name  price
0   phone    200
1  laptop    300
2  tablet    100